stappersg/Flipper-Zero-ESP32-Port/components/furi_hal/furi_hal_power.c
    int raw_value = 0;
    if(adc_oneshot_read(furi_hal_power.adc_handle, furi_hal_power.adc_channel, &raw_value) != ESP_OK) {
        furi_hal_power.last_sample_ok = false;
        return;
    }

    int pin_mv = 0;
    if(furi_hal_power.adc_cali_ready) {
        if(adc_cali_raw_to_voltage(furi_hal_power.adc_cali_handle, raw_value, &pin_mv) != ESP_OK) {
            furi_hal_power.last_sample_ok = false;
            return;
        }
    } else {
        pin_mv = (raw_value * 3300) / 4095;
    }

    float supply_voltage = ((float)pin_mv / 1000.0f) * FURI_HAL_POWER_ADC_DIVIDER_RATIO;
    if(supply_voltage < 0.0f) {
        supply_voltage = 0.0f;
    } else if(supply_voltage > 6.0f) {
        supply_voltage = 6.0f;
    }

    furi_hal_power.last_supply_voltage = supply_voltage;
    if(!furi_hal_power_is_usb_present()) {
        furi_hal_power.has_battery_reading = true;
        if(supply_voltage < FURI_HAL_POWER_EMPTY_BATTERY_VOLTAGE_V) {
            furi_hal_power.last_battery_voltage = FURI_HAL_POWER_EMPTY_BATTERY_VOLTAGE_V;
        } else if(supply_voltage > furi_hal_power.charge_voltage_limit) {
            furi_hal_power.last_battery_voltage = furi_hal_power.charge_voltage_limit;
        } else {
            furi_hal_power.last_battery_voltage = supply_voltage;
        }
    }

    furi_hal_power.last_sample_us = now;
    furi_hal_power.last_sample_ok = true;
}

static float furi_hal_power_get_estimated_battery_voltage(void) {
    furi_hal_power_refresh_sample();

    if(!furi_hal_power.last_sample_ok) {
        return 0.0f;
    }

    if(furi_hal_power_is_usb_present()) {
        return furi_hal_power.last_battery_voltage;
    }

    return furi_hal_power.last_supply_voltage;
}

void furi_hal_power_init(void) {
    furi_hal_power_ensure_initialized();

    /* Initialize shared I2C bus for power ICs (BQ27220 + BQ25896) */
#if defined(BOARD_PIN_QWIIC_SDA) && defined(BOARD_PIN_QWIIC_SCL)
    {
        i2c_config_t conf = {
            .mode = I2C_MODE_MASTER,
            .sda_io_num = BOARD_PIN_QWIIC_SDA,
            .scl_io_num = BOARD_PIN_QWIIC_SCL,
            .sda_pullup_en = GPIO_PULLUP_ENABLE,
            .scl_pullup_en = GPIO_PULLUP_ENABLE,
            .master.clk_speed = 100000,
        };
        i2c_param_config(I2C_NUM_0, &conf);
        esp_err_t i2c_err = i2c_driver_install(I2C_NUM_0, I2C_MODE_MASTER, 0, 0, 0);
        if(i2c_err != ESP_OK && i2c_err != ESP_ERR_INVALID_STATE) {
            ESP_LOGW(TAG, "Power I2C bus init failed: %s", esp_err_to_name(i2c_err));
        }
    }
#endif

    /* Allow power ICs to stabilize after PWR_EN and I2C bus init */
    vTaskDelay(pdMS_TO_TICKS(50));

    /* BQ27220 first (needs clean I2C bus), then BQ25896 */
    furi_hal_bq27220_init();
    furi_hal_bq25896_init();
    furi_hal_power_refresh_sample();
    if(furi_hal_bq27220_is_present()) {
        ESP_LOGI(TAG, "Fuel gauge: BQ27220 (%umV, %u%%)",
            furi_hal_bq27220_get_voltage_mv(), furi_hal_bq27220_get_charge_pct());
    }
    if(furi_hal_bq25896_is_present()) {
        ESP_LOGI(TAG, "Charger: BQ25896 (VBUS=%umV, VREG=%umV)",
            furi_hal_bq25896_get_vbus_voltage_mv(), furi_hal_bq25896_get_vreg_voltage_mv());
    }
}

bool furi_hal_power_gauge_is_ok(void) {
    if(furi_hal_bq27220_is_present()) return true;
    if(!furi_hal_power.adc_handle) return true;
    furi_hal_power_refresh_sample();
    return furi_hal_power.last_sample_ok;
}

bool furi_hal_power_is_shutdown_requested(void) {
    const float battery_voltage = furi_hal_power_get_estimated_battery_voltage();
    return !furi_hal_power_is_usb_present() &&
           (battery_voltage > 0.0f) &&
           (battery_voltage <= FURI_HAL_POWER_LOW_BATTERY_THRESHOLD_V);
}

uint16_t furi_hal_power_insomnia_level(void) {
    return furi_hal_power.insomnia;
}

void furi_hal_power_insomnia_enter(void) {
    FURI_CRITICAL_ENTER();
    furi_check(furi_hal_power.insomnia < UINT8_MAX);
    furi_hal_power.insomnia++;
    FURI_CRITICAL_EXIT();
}

void furi_hal_power_insomnia_exit(void) {
    FURI_CRITICAL_ENTER();
    furi_check(furi_hal_power.insomnia > 0);
    furi_hal_power.insomnia--;
    FURI_CRITICAL_EXIT();
}

bool furi_hal_power_sleep_available(void) {
    return furi_hal_power.insomnia == 0;
}

void furi_hal_power_sleep(void) {
    vTaskDelay(pdMS_TO_TICKS(1));
}

uint8_t furi_hal_power_get_pct(void) {
    /* BQ27220 fuel gauge (T-Embed CC1101) takes priority over ADC */
    if(furi_hal_bq27220_is_present()) {
        return furi_hal_bq27220_get_charge_pct();
    }
    if(!furi_hal_power.adc_handle) {
        return 100; /* No ADC, no fuel gauge → USB powered */
    }
    const float battery_voltage = furi_hal_power_get_estimated_battery_voltage();
    if(battery_voltage <= 0.0f) {
        return 0;
    }

    return furi_hal_power_voltage_to_pct(battery_voltage);
}

uint8_t furi_hal_power_get_bat_health_pct(void) {
    if(furi_hal_bq27220_is_present()) {
        return furi_hal_bq27220_get_health_pct();
    }
    return furi_hal_power_gauge_is_ok() ? 100 : 0;
}

bool furi_hal_power_is_charging(void) {
    /* Prefer BQ25896 charger status (like STM32), fallback to BQ27220 */
    if(furi_hal_bq25896_is_present()) {
        return furi_hal_bq25896_is_charging();
    }
    if(furi_hal_bq27220_is_present()) {
        return furi_hal_bq27220_is_charging();
    }
    furi_hal_power_refresh_sample();
    return furi_hal_power_is_usb_present() && (furi_hal_power.suppress_charge == 0);
}

bool furi_hal_power_is_charging_done(void) {
    if(!furi_hal_power.has_battery_reading) {
        return false;
    }
    return furi_hal_power_is_charging() && (furi_hal_power_get_pct() >= 100);
}

/* Physical button used to both confirm power-off (must be released first) and
 * to wake the device back up from deep sleep. Mirrors Bruce, where the T-Embed
 * CC1101 sleeps on and wakes from the side "ESC"/Back key (BK_BTN = GPIO6),
 * NOT the encoder/BOOT button. BOARD_PIN_BUTTON_KEY is that same physical key. */
#ifdef BOARD_PIN_BUTTON_KEY
#define FURI_HAL_POWER_WAKE_PIN BOARD_PIN_BUTTON_KEY
#else
#define FURI_HAL_POWER_WAKE_PIN BOARD_PIN_BUTTON_BOOT
#endif

/* Hand the next boot to the launcher (Bruce) so that waking from deep sleep
 * comes up in the multi-boot menu instead of straight back into this firmware.
 * This is the exact mirror of Bruce's "Reboot to Flipper" menu entry
 * (FlipperOsMenu: esp_ota_set_boot_partition() + reboot), just pointed the
 * other way. We pick the "next" OTA slot — the one we are NOT running from —
 * rather than a hardcoded partition, so it is correct no matter which slot
 * booted us. If the launcher slot holds no valid image (single-app build, or
 * the launcher was never flashed), esp_ota_set_boot_partition() fails and we
 * fall back to cold-booting this firmware again — matching the user's rule of
 * "boot the launcher if present, otherwise boot the default firmware". */
static void furi_hal_power_select_launcher_boot(void) {
    const esp_partition_t* launcher = esp_ota_get_next_update_partition(NULL);
    if(launcher == NULL) {
        ESP_LOGW(TAG, "No second app slot — staying on this firmware");
        return;
    }
    const esp_err_t err = esp_ota_set_boot_partition(launcher);
    if(err == ESP_OK) {
        ESP_LOGI(TAG, "Next boot -> launcher partition '%s'", launcher->label);
    } else {
        ESP_LOGW(TAG, "Launcher partition not bootable (%s) — staying on this firmware",
            esp_err_to_name(err));
    }
}

/* Ported from Bruce's deep-sleep power-off (boards/lilygo-t-embed-cc1101/
 * interface.cpp checkReboot()):
 *
 *     while (digitalRead(BK_BTN) == BTN_ACT);   // wait for ESC release
 *     delay(200);
 *     tft.sleep(true);
 *     delay(1000);                              // debounce
 *     digitalWrite(PIN_POWER_ON, LOW);          // cut peripheral power
 *     esp_sleep_enable_ext0_wakeup(GPIO_NUM_6, LOW);
 *     esp_deep_sleep_start();
 *
 * Kept intentionally minimal and free of any gpio_hold()/deep-sleep pin
 * latching: Bruce does none, and latching the backlight pin LOW would survive
 * the wake into the *next* firmware (the launcher), leaving it dark on a black
 * screen — which looks exactly like "nothing happened". Waking on the ESC key
 * re-runs the bootloader, which re-reads the OTA selection set above, so the
 * device comes up in the launcher as if the RST button had been pressed. */
void furi_hal_power_shutdown(void) {
    /* Wait for the ESC/side key to be released so we don't immediately re-wake.
     * (Bruce: `while (digitalRead(BK_BTN) == BTN_ACT);`) */
    while(gpio_get_level((gpio_num_t)FURI_HAL_POWER_WAKE_PIN) == 0) {
        vTaskDelay(pdMS_TO_TICKS(10));
    }
    vTaskDelay(pdMS_TO_TICKS(200)); /* Bruce: delay(200) */

    /* Select the launcher for the next boot while the system is still fully
     * alive (flash, clocks, RTOS all up) — must happen before deep sleep. */
    furi_hal_power_select_launcher_boot();

    /* Backlight off + panel to sleep. (Bruce: implicit BL off + tft.sleep(true))
     * No gpio_hold — let the next firmware own the pins from a clean state. */
#ifdef BOARD_PIN_LCD_BL
    furi_hal_display_set_backlight(0);
#endif
    furi_hal_display_sleep();

    vTaskDelay(pdMS_TO_TICKS(200)); /* short debounce before cutting power */

    /* Cut peripheral power — CC1101 + NFC + WS2812. (Bruce: digitalWrite(
     * PIN_POWER_ON, LOW) + powerDownNFC()/powerDownCC1101().) */
#ifdef BOARD_PIN_PWR_EN
    gpio_set_level((gpio_num_t)BOARD_PIN_PWR_EN, 0);
#endif

    /* Wake on the ESC/side key (active low), matching Bruce's
     * `esp_sleep_enable_ext0_wakeup(GPIO_NUM_6, LOW)`. */
#if SOC_PM_SUPPORT_EXT0_WAKEUP
    esp_sleep_enable_ext0_wakeup((gpio_num_t)FURI_HAL_POWER_WAKE_PIN, 0);
#else
    esp_deep_sleep_enable_gpio_wakeup(BIT(FURI_HAL_POWER_WAKE_PIN), ESP_GPIO_WAKEUP_GPIO_LOW);
#endif
    esp_deep_sleep_start();
}

void furi_hal_power_off(void) {
    furi_hal_power_shutdown();
}

