stappersg/Flipper-Zero-ESP32-Port/components/furi_hal/furi_hal_power.c
FURI_NORETURN void furi_hal_power_reset(void) {
    esp_restart();
    __builtin_unreachable();
}

bool furi_hal_power_enable_otg(void) {
    furi_hal_power.otg_enabled = true;
    return true;
}

void furi_hal_power_disable_otg(void) {
    furi_hal_power.otg_enabled = false;
}

bool furi_hal_power_check_otg_fault(void) {
    return false;
}

void furi_hal_power_check_otg_status(void) {
}

bool furi_hal_power_is_otg_enabled(void) {
    return furi_hal_power.otg_enabled;
}

float furi_hal_power_get_battery_charge_voltage_limit(void) {
    if(furi_hal_bq25896_is_present()) {
        return (float)furi_hal_bq25896_get_vreg_voltage_mv() / 1000.0f;
    }
    return furi_hal_power.charge_voltage_limit;
}

void furi_hal_power_set_battery_charge_voltage_limit(float voltage) {
    furi_hal_power.charge_voltage_limit = furi_hal_power_quantize_charge_limit(voltage);
    if(furi_hal_bq25896_is_present()) {
        furi_hal_bq25896_set_vreg_voltage_mv((uint16_t)(voltage * 1000.0f));
    }
}

uint32_t furi_hal_power_get_battery_remaining_capacity(void) {
    if(furi_hal_bq27220_is_present()) {
        return furi_hal_bq27220_get_remaining_capacity_mah();
    }
    return (uint32_t)((furi_hal_power_get_pct() * FURI_HAL_POWER_VIRTUAL_CAPACITY_MAH) / 100U);
}

uint32_t furi_hal_power_get_battery_full_capacity(void) {
    if(furi_hal_bq27220_is_present()) {
        return furi_hal_bq27220_get_full_charge_capacity_mah();
    }
    return FURI_HAL_POWER_VIRTUAL_CAPACITY_MAH;
}

uint32_t furi_hal_power_get_battery_design_capacity(void) {
    if(furi_hal_bq27220_is_present()) {
        return furi_hal_bq27220_get_design_capacity_mah();
    }
    return FURI_HAL_POWER_VIRTUAL_CAPACITY_MAH;
}

float furi_hal_power_get_battery_voltage(FuriHalPowerIC ic) {
    if(ic == FuriHalPowerICCharger && furi_hal_bq25896_is_present()) {
        return (float)furi_hal_bq25896_get_vbat_voltage_mv() / 1000.0f;
    }
    if(ic == FuriHalPowerICFuelGauge && furi_hal_bq27220_is_present()) {
        return (float)furi_hal_bq27220_get_voltage_mv() / 1000.0f;
    }
    /* Fallback: try whichever is available */
    if(furi_hal_bq27220_is_present()) {
        return (float)furi_hal_bq27220_get_voltage_mv() / 1000.0f;
    }
    if(furi_hal_bq25896_is_present()) {
        return (float)furi_hal_bq25896_get_vbat_voltage_mv() / 1000.0f;
    }
    return furi_hal_power_get_estimated_battery_voltage();
}

float furi_hal_power_get_battery_current(FuriHalPowerIC ic) {
    if(ic == FuriHalPowerICCharger && furi_hal_bq25896_is_present()) {
        return (float)furi_hal_bq25896_get_vbat_current_ma() / 1000.0f;
    }
    if(ic == FuriHalPowerICFuelGauge && furi_hal_bq27220_is_present()) {
        return (float)furi_hal_bq27220_get_current_ma() / 1000.0f;
    }
    if(furi_hal_bq27220_is_present()) {
        return (float)furi_hal_bq27220_get_current_ma() / 1000.0f;
    }
    return 0.0f;
}

float furi_hal_power_get_battery_temperature(FuriHalPowerIC ic) {
    if(ic == FuriHalPowerICCharger && furi_hal_bq25896_is_present()) {
        return (float)furi_hal_bq25896_get_temperature_mc() / 1000.0f;
    }
    if(ic == FuriHalPowerICFuelGauge && furi_hal_bq27220_is_present()) {
        /* BQ27220 returns 0.1°K, convert to °C: (raw - 2731) / 10 */
        uint16_t raw = furi_hal_bq27220_get_temperature_raw();
        return ((float)raw - 2731.0f) / 10.0f;
    }
    /* Fallback */
    if(furi_hal_bq27220_is_present()) {
        uint16_t raw = furi_hal_bq27220_get_temperature_raw();
        return ((float)raw - 2731.0f) / 10.0f;
    }
    if(furi_hal_bq25896_is_present()) {
        return (float)furi_hal_bq25896_get_temperature_mc() / 1000.0f;
    }
    return 25.0f;
}

float furi_hal_power_get_usb_voltage(void) {
    if(furi_hal_bq25896_is_present()) {
        return (float)furi_hal_bq25896_get_vbus_voltage_mv() / 1000.0f;
    }
    furi_hal_power_refresh_sample();
    return furi_hal_power_is_usb_present() ? furi_hal_power.last_supply_voltage : 0.0f;
}

void furi_hal_power_enable_external_3_3v(void) {
}

void furi_hal_power_disable_external_3_3v(void) {
}

void furi_hal_power_suppress_charge_enter(void) {
    FURI_CRITICAL_ENTER();
    if(furi_hal_power.suppress_charge < UINT8_MAX) {
        furi_hal_power.suppress_charge++;
    }
    FURI_CRITICAL_EXIT();
}

void furi_hal_power_suppress_charge_exit(void) {
    FURI_CRITICAL_ENTER();
    if(furi_hal_power.suppress_charge > 0) {
        furi_hal_power.suppress_charge--;
    }
    FURI_CRITICAL_EXIT();
}

void furi_hal_power_info_get(PropertyValueCallback out, char sep, void* context) {
    furi_check(out);

    FuriString* key = furi_string_alloc();
    FuriString* value = furi_string_alloc();
    PropertyValueContext property_context = {
        .key = key,
        .value = value,
        .out = out,
        .sep = sep,
        .last = false,
        .context = context,
    };

    property_value_out(&property_context, NULL, 2, "format", "major", "2");
    property_value_out(&property_context, NULL, 2, "format", "minor", "0");
    property_value_out(&property_context, "%u", 2, "charge", "level", furi_hal_power_get_pct());
    property_value_out(
        &property_context,
        NULL,
        2,
        "charge",
        "state",
        furi_hal_power_is_charging() ?
            (furi_hal_power_is_charging_done() ? "charged" : "charging") :
            "discharging");
    property_value_out(
        &property_context,
        "%u",
        3,
        "charge",
        "voltage",
        "limit",
        (unsigned int)lroundf(furi_hal_power_get_battery_charge_voltage_limit() * 1000.0f));
    property_value_out(
        &property_context,
        "%u",
        2,
        "battery",
        "voltage",
        (unsigned int)lroundf(
            furi_hal_power_get_battery_voltage(FuriHalPowerICFuelGauge) * 1000.0f));
    property_value_out(
        &property_context,
        "%u",
        2,
        "battery",
        "health",
        furi_hal_power_get_bat_health_pct());
    property_context.last = true;
    property_value_out(
        &property_context,
        "%lu",
        2,
        "capacity",
        "remain",
        (unsigned long)furi_hal_power_get_battery_remaining_capacity());

    furi_string_free(key);
    furi_string_free(value);
}

void furi_hal_power_debug_get(PropertyValueCallback out, void* context) {
    furi_check(out);

    FuriString* key = furi_string_alloc();
    FuriString* value = furi_string_alloc();
    PropertyValueContext property_context = {
        .key = key,
        .value = value,
        .out = out,
        .sep = '.',
        .last = false,
        .context = context,
    };

    property_value_out(&property_context, NULL, 2, "format", "major", "1");
    property_value_out(&property_context, NULL, 2, "format", "minor", "0");
    property_value_out(
        &property_context,
        "%u",
        2,
        "adc",
        "gpio",
        (unsigned int)gpio_battery_sense.pin);
    property_value_out(
        &property_context,
        "%u",
        2,
        "adc",
        "ready",
        furi_hal_power_gauge_is_ok() ? 1U : 0U);
    property_value_out(
        &property_context,
        "%u",
        2,
        "supply",
        "mv",
        (unsigned int)lroundf(furi_hal_power.last_supply_voltage * 1000.0f));
    property_context.last = true;
    property_value_out(
        &property_context,
        "%u",
        2,
        "battery",
        "mv",
        (unsigned int)lroundf(furi_hal_power_get_estimated_battery_voltage() * 1000.0f));

    furi_string_free(key);
    furi_string_free(value);
}
